app/views/welcome/index.html.erb


        <% Team.find(game.home_team).title
---
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 6]]