app/views/games/_form.html.erb

SELECT "teams".* FROM "teams"
---
      <%= f.label :home_team %><br>
      <%= f.collection_select(:home_team, Team.all, :id, :title) %>