app/views/games/index.html.erb

SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 4]]
---
          <div class="article-title">
            <h2><%= Team.find(game.home_team).title %></h2>