app/views/vcr_teams/show.html.erb

          <div class="teamlogo-container">
            <div class="teamlogo" style="background: url(<%= Team.find(game.home_team).logo %>);background-position: center; background-size: contain;">
---
SELECT  "vcr_teams".* FROM "vcr_teams"  WHERE "vcr_teams"."id" = ? LIMIT 1  [["id", 3]]