app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order('created_at DESC')
    @games = Game.where('date >= ?', Date.today).order('date ASC').limit(3)
---
SELECT "articles".* FROM "articles"   ORDER BY created_at DESC
SELECT  "games".* FROM "games"  WHERE (date >= '2015-03-27')  ORDER BY date ASC LIMIT 3

  def show
    @article = Article.find(params[:id])
    @sponsors = Sponsor.all
    @games = Game.where('date >= ?', Date.today).order('date ASC').limit(3)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
SELECT "sponsors".* FROM "sponsors"
SELECT  "games".* FROM "games"  WHERE (date >= '2015-03-26')  ORDER BY date ASC LIMIT 3

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 8  [["image_file_name", "512.jpg"], ["image_file_size", 297762], ["image_updated_at", "2015-01-16 14:07:18.124299"], ["updated_at", "2015-01-16 14:07:18.152907"]]