app/controllers/games_controller.rb

  def index
    @games = Game.all.order('date ASC')
---
SELECT "games".* FROM "games"   ORDER BY datetime DESC

  def create
    @game = Game.new(game_params)

    if @game.save
---
INSERT INTO "games" ("away_team", "created_at", "date", "home_team", "updated_at") VALUES (?, ?, ?, ?, ?)  [["away_team", 2], ["created_at", "2015-03-19 15:11:37.814455"], ["date", "2015-03-19 15:10:00.000000"], ["home_team", 2], ["updated_at", "2015-03-19 15:11:37.814455"]]

  def update
    @game = Game.find(params[:id])

    if @game.update(game_params)
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "games" SET "away_score" = ?, "home_score" = ?, "updated_at" = ? WHERE "games"."id" = 7  [["away_score", 5], ["home_score", 0], ["updated_at", "2015-03-27 10:24:11.140034"]]

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]