app/controllers/members_controller.rb

SELECT "members".* FROM "members"   ORDER BY name DESC
---
  def index
    @members = Member.all.order('name DESC')

INSERT INTO "members" ("birth_date", "created_at", "email", "name", "occupation", "phone", "team", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @member = Member.new(member_params)

    if @member.save

SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
---
  def update
    @member = Member.find(params[:id])

SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 1]]
---
  def destroy
    @member = Member.find(params[:id])
    @member.destroy