app/controllers/sponsors_controller.rb

SELECT "sponsors".* FROM "sponsors"
---
  def index
    @sponsors = Sponsor.all

SELECT  "sponsors".* FROM "sponsors"  WHERE "sponsors"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @sponsor = Sponsor.find(params[:id])

INSERT INTO "sponsors" ("created_at", "logo_content_type", "logo_file_name", "logo_file_size", "logo_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sponsor = Sponsor.new(sponsor_params)

    if @sponsor.save

SELECT  "sponsors".* FROM "sponsors"  WHERE "sponsors"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "sponsors" WHERE "sponsors"."id" = ?  [["id", 1]]
---
  def destroy
    @sponsor = Sponsor.find(params[:id])
    @sponsor.destroy