app/controllers/teams_controller.rb

INSERT INTO "teams" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-23 15:33:26.388612"], ["title", "dsadsfas"], ["updated_at", "2015-01-23 15:33:26.388612"]]
---
  def create
    @team = Team.new(team_params)

    if @team.save

SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "teams" SET "logo_content_type" = ?, "logo_file_name" = ?, "logo_file_size" = ?, "logo_updated_at" = ?, "updated_at" = ? WHERE "teams"."id" = 7  [["logo_content_type", "image/jpeg"], ["logo_file_name", "vcr.jpg"], ["logo_file_size", 7500], ["logo_updated_at", "2015-03-26 13:45:13.655014"], ["updated_at", "2015-03-26 13:45:13.734003"]]
---
  def update
    @team = Team.find(params[:id])

    if @team.update(team_params)

SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "games".* FROM "games"  WHERE (home_team = 9)
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
DELETE FROM "games" WHERE (home_team = 9)
---
  def destroy
    @team = Team.find(params[:id])
    @home_team = Game.where(["home_team = ?", @team])
    @away_team = Game.where(["away_team = ?", @team])

    if !@home_team.present? && !@away_team.present?
      @team.destroy
      redirect_to teams_path
    elsif @home_team.present?
      Game.delete_all(["home_team = ?", @team])