app/controllers/vcr_teams_controller.rb

SELECT "vcr_teams".* FROM "vcr_teams"  WHERE (age_group = 'Senioren')  ORDER BY title ASC
---
  def index
    @vcr_teams = VcrTeam.all.order('title ASC')

SELECT  "vcr_teams".* FROM "vcr_teams"  WHERE "vcr_teams"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @vcr_team = VcrTeam.find(params[:id])

SELECT "vcr_teams".* FROM "vcr_teams"  WHERE (age_group = 'Senioren')  ORDER BY title ASC
SELECT "members".* FROM "members"  WHERE (team == 3)
SELECT  "games".* FROM "games"  WHERE (date >= '2015-04-02')  ORDER BY date ASC LIMIT 3
---
  def show
    @vcr_team = VcrTeam.find(params[:id])
    @players = Member.where('team == ?', @vcr_team.id).where('occupation == ?', 'Speler')
    @vcr_games = VcrGame.where('vcr_team == ?', @vcr_team.id).order('date ASC')
    @sponsors = Sponsor.all
    @games = Game.where('date >= ?', Date.today).order('date ASC').limit(3)

INSERT INTO "vcr_teams" ("age_group", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["age_group", "Junioren"], ["created_at", "2015-04-02 09:27:04.998469"], ["title", "VCR B1"], ["updated_at", "2015-04-02 09:27:04.998469"]]
---
  def create
    @vcr_team = VcrTeam.new(vcr_team_params)
    @age_group = "Senioren", "Junioren", "Pupillen"

    if @vcr_team.save

SELECT  "vcr_teams".* FROM "vcr_teams"  WHERE "vcr_teams"."id" = ? LIMIT 1  [["id", 3]]
---
  def update
    @vcr_team = VcrTeam.find(params[:id])

SELECT  "vcr_teams".* FROM "vcr_teams"  WHERE "vcr_teams"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "vcr_teams" WHERE "vcr_teams"."id" = ?  [["id", 1]]
---
  def destroy
    @vcr_team = VcrTeam.find(params[:id])

    @vcr_game = VcrGame.where(["vcr_team = ?", @vcr_team])

    if !@vcr_game.present?
      @vcr_team.destroy