app/controllers/welcome_controller.rb

SELECT "articles".* FROM "articles"   ORDER BY created_at DESC
SELECT "sponsors".* FROM "sponsors"
SELECT  "games".* FROM "games"  WHERE (created_at >= date.today)  ORDER BY date ASC LIMIT 3
---
  def index
    @articles = Article.all.order('created_at DESC').limit(6)
    @sponsors = Sponsor.all
    @games = Game.where('date >= ?', Date.today).order('date ASC').limit(3)