app/views/members/_form.html.erb

SELECT "vcr_teams".* FROM "vcr_teams"
---
    <%= f.label :team %><br>
    <%= f.collection_select(:team, VcrTeam.all, :id, :title) %>