app/views/members/index.html.erb

SELECT  "vcr_teams".* FROM "vcr_teams"  WHERE "vcr_teams"."id" = ? LIMIT 1  [["id", 4]]
---
        <td><%= member.occupation %></td>
        <td><%= VcrTeam.find(member.team).title %></td>