app/views/members/show.html.erb

        <p>
          <%= VcrTeam.find(@member.team).title %>
---
SELECT  "vcr_teams".* FROM "vcr_teams"  WHERE "vcr_teams"."id" = ? LIMIT 1  [["id", 4]]